app/controllers/comments_controller.rb

INSERT INTO "comments" ("name", "content", "created_at", "updated_at", "photo_file_name", "photo_content_type", "photo_file_size", "photo_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @comment = Comment.new(comment_params)

    respond_to do |format|
      if @comment.save