app/controllers/courses_controller.rb

  def create
    @course = Course.new(course_params)
    @course_types = [['Desarrollo personal','Desarrollo personal'],['Desarrollo empresarial','Desarrollo empresarial'],['Servicio al cliente','Servicio al cliente'],['Desarrollo profesional','Desarrollo profesional']]

    respond_to do |format|
      if @course.save
---
INSERT INTO "courses" ("course_name", "course_content", "created_at", "updated_at") VALUES (?, ?, ?, ?)

  def update
    respond_to do |format|
      if @course.update(course_params)
---
UPDATE "courses" SET "course_name" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["course_name", "COCTELERÍA TIKI: PREPARACIÓN DE TRAGOS DE FANTASÍA"], ["updated_at", "2017-06-22 03:27:11.506756"], ["id", 4]]

    def set_course
      @course = Course.find(params[:id])
---
SELECT "courses".* FROM "courses" WHERE "courses"."type" = ?  [["type", "Desarrollo personal"]]