app/controllers/covers_controller.rb

SELECT "covers".* FROM "covers"
---
  def index
    @covers = Cover.all

INSERT INTO "covers" ("title", "description", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @cover = Cover.new(cover_params)

    respond_to do |format|
      if @cover.save

UPDATE "covers" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "covers"."id" = ?  [["title", "Escuela de Negocios"], ["description", " Nelson Mandela"], ["updated_at", "2017-10-03 13:29:12.152249"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @cover.update(cover_params)

SELECT  "covers".* FROM "covers" WHERE "covers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_cover
      @cover = Cover.find(params[:id])