app/controllers/info_texts_controller.rb

SELECT "info_texts".* FROM "info_texts"
---
  def index
    @info_texts = InfoText.all

INSERT INTO "info_texts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    @info_text = InfoText.new(info_text_params)

    respond_to do |format|
      if @info_text.save

SELECT  "info_texts".* FROM "info_texts" WHERE "info_texts"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_info_text
      @info_text = InfoText.find(params[:id])