app/controllers/main_controller.rb

  def index
    @comments = Comment.limit(3)
    @covers = Cover.limit(3)
    @notices = Notice.limit(3)
    @whoWeAre = InfoText.find_by(title: "Quienes somos")
    @academicOffers = InfoText.find_by(title: "Ofertas academicas")
    @liveTheExperience = InfoText.find_by(title: "Vive la experiencia")
    @courses = Course.all
---
SELECT  "comments".* FROM "comments" LIMIT ?  [["LIMIT", 3]]
SELECT  "covers".* FROM "covers" LIMIT ?  [["LIMIT", 3]]
SELECT  "notices".* FROM "notices" LIMIT ?  [["LIMIT", 3]]
SELECT  "info_texts".* FROM "info_texts" WHERE "info_texts"."title" = ? LIMIT ?  [["title", "Quienes somos"], ["LIMIT", 1]]
SELECT "courses".* FROM "courses"