app/controllers/notices_controller.rb

SELECT "notices".* FROM "notices"
---
  def index
    @notices = Notice.all

INSERT INTO "notices" ("title", "link", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    @notice = Notice.new(notice_params)

    respond_to do |format|
      if @notice.save

UPDATE "notices" SET "link" = ?, "updated_at" = ? WHERE "notices"."id" = ?  [["link", "http://placesmap.net/BO/Escuela-De-Negocios-Nelson-Mandela-44917/"], ["updated_at", "2017-10-03 13:57:57.829333"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @notice.update(notice_params)

SELECT  "notices".* FROM "notices" WHERE "notices"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_notice
      @notice = Notice.find(params[:id])